/**
  *************************************************************************************************************************
  * @file    lcd.h
  * @author  
  * @version V1.0
  * @date    2020-03-19
  * @brief   STC89C51 lcd.h文件
  *************************************************************************************************************************
  * @attention
  * 
  * 此lcd.c文件适用于LCD1602模块
  * 
	*						
  *************************************************************************************************************************
  */

/* Define to prevent recursive inclusion --------------------------------------------------------------------------------*/
#ifndef __LCD_H
#define	__LCD_H

/* Includes -------------------------------------------------------------------------------------------------------------*/
#include "reg52.h"

/* 定义 -----------------------------------------------------------------------------------------------------------------*/
/* 当使用的是4位数据传输的时候定义，使用8位取消这个定义*/
//#define LCD1602_4PINS

/* 8位数据传输口 */
#define    LCD1602_DATAPINS    (P0)

/* 相关管脚定义 */
sbit LCD1602_RS = P1^3;
sbit LCD1602_RW = P1^4;
sbit LCD1602_E  = P1^5;

/* LCD1602显示的内容 */
extern unsigned char display1[16]; /* LCD1602第一行显示的内容 */
extern unsigned char display2[16]; /* LCD1602第二行显示的内容 */

/* 提供给其他C文件调用的函数 --------------------------------------------------------------------------------------------*/
void Lcd1602_Delay1ms(unsigned int c); /* 在51单片机12MHZ时钟下的延时函数 */
void LcdWriteCom(unsigned char com);	 /* LCD1602写入8位命令子函数 */
void LcdWriteData(unsigned char dat);  /* LCD1602写入8位数据子函数 */	
void LcdInit(void);								 		 /* LCD1602初始化 */		
void LcdDisplay(unsigned char disp1[16], unsigned char disp2[16]); /* LCD1602显示函数 */
void LCD_WriteDisplay(unsigned char x, unsigned char y, unsigned char dat);
void LCD_ClearLine(unsigned char line);

#endif /* __LCD_H */

/*****************************************************END OF FILE*********************************************************/	
